<a href="https://colab.research.google.com/github/Siddhant-Negi/DMDWLAB/blob/main/18CSE104_ass3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import pandas as pd 
url="https://raw.githubusercontent.com/Anasuya-Sahoo/DMDW-Lab/main/Toyota.csv"
df=pd.read_csv(url)

In [3]:
print(df)

      Unnamed: 0  Price   Age     KM  ... Automatic    CC  Doors  Weight
0              0  13500  23.0  46986  ...         0  2000  three    1165
1              1  13750  23.0  72937  ...         0  2000      3    1165
2              2  13950  24.0  41711  ...         0  2000      3    1165
3              3  14950  26.0  48000  ...         0  2000      3    1165
4              4  13750  30.0  38500  ...         0  2000      3    1170
...          ...    ...   ...    ...  ...       ...   ...    ...     ...
1431        1431   7500   NaN  20544  ...         0  1300      3    1025
1432        1432  10845  72.0     ??  ...         0  1300      3    1015
1433        1433   8500   NaN  17016  ...         0  1300      3    1015
1434        1434   7250  70.0     ??  ...         0  1300      3    1015
1435        1435   6950  76.0      1  ...         0  1600      5    1114

[1436 rows x 11 columns]

In [4]:
df.shape

(1436, 11)

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1436 entries, 0 to 1435
Data columns (total 11 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  1436 non-null   int64
 1   Price       1436 non-null   int64
 2   Age         1336 non-null   float64
 3   KM          1436 non-null   object
 4   FuelType    1336 non-null   object
 5   HP          1436 non-null   object
 6   MetColor    1286 non-null   float64
 7   Automatic   1436 non-null   int64
 8   CC          1436 non-null   int64
 9   Doors       1436 non-null   object
 10  Weight      1436 non-null   int64
dtypes: float64(2), int64(5), object(4)
memory usage: 123.5+ KB

In [6]:
df.head()

   Unnamed: 0  Price   Age     KM  ... Automatic    CC  Doors  Weight
0           0  13500  23.0  46986  ...         0  2000  three    1165
1           1  13750  23.0  72937  ...         0  2000      3    1165
2           2  13950  24.0  41711  ...         0  2000      3    1165
3           3  14950  26.0  48000  ...         0  2000      3    1165
4           4  13750  30.0  38500  ...         0  2000      3    1170

[5 rows x 11 columns]

In [7]:
df.loc[:10,['Price','Age']]

    Price   Age
0   13500  23.0
1   13750  23.0
2   13950  24.0
3   14950  26.0
4   13750  30.0
5   12950  32.0
6   16900  27.0
7   18600  30.0
8   21500  27.0
9   12950  23.0
10  20950  25.0

In [9]:
df[['Price',"Age"]].head(10)

   Price   Age
0  13500  23.0
1  13750  23.0
2  13950  24.0
3  14950  26.0
4  13750  30.0
5  12950  32.0
6  16900  27.0
7  18600  30.0
8  21500  27.0
9  12950  23.0

In [10]:
df.isnull().sum()

Unnamed: 0      0
Price           0
Age           100
KM              0
FuelType      100
HP              0
MetColor      150
Automatic       0
CC              0
Doors           0
Weight          0
dtype: int64

In [11]:
import numpy as np

In [12]:
df['MetColor'].fillna(np.mean(df['MetColor']),inplace=True)

In [13]:
df.isnull().sum()

Unnamed: 0      0
Price           0
Age           100
KM              0
FuelType      100
HP              0
MetColor        0
Automatic       0
CC              0
Doors           0
Weight          0
dtype: int64

In [14]:
df.dropna(inplace=True)

In [15]:
df.isnull().sum()

Unnamed: 0    0
Price         0
Age           0
KM            0
FuelType      0
HP            0
MetColor      0
Automatic     0
CC            0
Doors         0
Weight        0
dtype: int64

In [16]:
df.shape

(1243, 11)

In [17]:
df['MetColor'].mean()

0.6750562090162147

In [19]:
df['MetColor'].head()

0    1.000000
1    1.000000
2    0.674961
3    0.000000
4    0.000000
Name: MetColor, dtype: float64

In [20]:
df['CC'].mean()

1570.532582461786

In [21]:
df['CC'].head()

0    2000
1    2000
2    2000
3    2000
4    2000
Name: CC, dtype: int64

In [23]:
df[['Age',"KM"]].head(20)

     Age     KM
0   23.0  46986
1   23.0  72937
2   24.0  41711
3   26.0  48000
4   30.0  38500
5   32.0  61000
6   27.0     ??
8   27.0  19700
9   23.0  71138
10  25.0  31461
11  22.0  43610
12  25.0  32189
13  31.0  23000
14  32.0  34131
15  28.0  18739
16  30.0  34000
17  24.0  21716
18  24.0  25563
19  30.0  64359
20  30.0  67660